In [17]:
import sys
import os
lib=os.getcwd()+"/lib"
sys.path.append(lib) 

cfg=os.getcwd()+"/resource/cfg/ds.json"

In [18]:
import udf.pg as p
ds = p.Pg(cfg)
df = ds.query("select user_id from member_users order by user_id asc","dev")
v=df['user_id'].to_numpy()

In [19]:
class MyQuery(p.ISubQ):
        
    def sql(self, ids):
        return "select user_id,ct from member_users where user_id in"+str(tuple(ids))+" order by user_id asc"

In [20]:
result=ds.queryall(df["user_id"],sb=MyQuery(),db="dev",eachSize=10000)
result.describe()

Done

             user_id            ct
count  303912.000000  3.039120e+05
mean   153377.859966  1.567255e+12
std     88145.931465  3.035794e+09
min         1.000000  1.566981e+12
25%     77184.750000  1.566983e+12
50%    153624.500000  1.566985e+12
75%    229602.250000  1.566987e+12
max    309751.000000  1.620894e+12

In [21]:
df=df.set_index('user_id',drop=False)
df

         user_id
user_id
1              1
5              5
7              7
8              8
9              9
...          ...
309746    309746
309747    309747
309748    309748
309750    309750
309751    309751

[303912 rows x 1 columns]

In [22]:
e2=result.set_index(result['user_id'],drop=False)
e2

         user_id             ct
user_id
1              1  1566989096130
5              5  1566989096200
7              7  1566989096235
8              8  1566989096253
9              9  1566989096275
...          ...            ...
309746    309746  1620433056911
309747    309747  1620433646137
309748    309748  1620466001906
309750    309750  1620801798492
309751    309751  1620894235204

[303912 rows x 2 columns]